[
  {
    "image": "https://i.imgur.com/5WURlhy.png",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "WhatsApp is a globally recognized messaging application developed by Meta Platforms, Inc., offering a seamless and secure platform for instant communication. With end-to-end encryption, WhatsApp allows users to send text messages, share images, videos, and voice notes, and conduct crystal-clear voice and video calls. It supports both one-on-one and group chats, making it ideal for personal and professional communication. WhatsApp also includes features like status updates, document sharing, live location, and more. Whether you’re coordinating with family, managing a team, or staying in touch with friends abroad, WhatsApp provides a fast, reliable, and user-friendly experience across Android, iOS, and desktop devices.",
    "size": 200,
    "reviews": "50K",
    "ratingAvg": 4.8,
    "downloads": "1000M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "image": "https://i.imgur.com/4telTg7.jpeg",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 2,
    "description": "TikTok, developed by ByteDance, is a popular short-form video platform that empowers users to create, discover, and share creative content in just seconds. With an endless scroll of entertaining clips across genres — from comedy and dance to education and daily vlogs — TikTok keeps users engaged through powerful algorithms that personalize content. The app features a full suite of editing tools, music tracks, effects, and filters to help creators bring their ideas to life. Whether you're following viral challenges, showcasing your talent, or connecting with fans, TikTok offers a dynamic social video experience that's changing how content is consumed and created.",
    "size": 250,
    "reviews": "40K",
    "ratingAvg": 4.7,
    "downloads": "800M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/95/Instagram_logo_2022.svg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram, a flagship product by Meta Platforms, Inc., is a visually-driven social networking platform designed for sharing life’s moments through photos, videos, stories, and reels. With powerful editing tools and a range of creative filters, users can express themselves artistically. Features like Instagram Stories, Live, IGTV, and Reels allow for deeper engagement and creative storytelling. Instagram is also a major platform for influencers, brands, and businesses to build communities, run promotions, and sell products directly through shopping tools. With its intuitive interface and global user base, Instagram is more than an app — it’s a lifestyle.",
    "size": 150,
    "reviews": "35K",
    "ratingAvg": 4.6,
    "downloads": "700M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 3000000 }
    ]
  },
  {
    "image": "https://i.imgur.com/S0DVOLH.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "Facebook, developed by Meta Platforms, Inc., is one of the world’s most widely used social networking platforms. It helps users stay connected with friends, family, and communities across the globe. Whether you're sharing life updates, joining groups, hosting events, or watching live videos, Facebook integrates countless features into one powerful ecosystem. The app also offers a personalized News Feed, Marketplace for buying and selling locally, and Watch for video content. With built-in Messenger and support for business pages and advertising, Facebook continues to be a comprehensive platform for both social connection and digital commerce.",
    "size": 300,
    "reviews": "30K",
    "ratingAvg": 4.5,
    "downloads": "600M",
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-vector/telegram-icon_459124-2002.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "Telegram",
    "companyName": "Telegram Messenger LLP",
    "id": 5,
    "description": "Telegram, created by Telegram Messenger LLP, is a fast and secure cloud-based messaging app that emphasizes privacy and speed. With its robust encryption, Telegram allows users to send messages, make voice/video calls, share files of any type, and create channels for broadcasting. It supports large group chats and bots, making it popular among developers and communities. Telegram’s features like Secret Chats, self-destructing messages, and multi-device sync set it apart in the realm of privacy-first communication. Lightweight and highly customizable, Telegram is ideal for both personal and large-scale communication needs.",
    "size": 180,
    "reviews": "25K",
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/055/030/388/non_2x/capcut-circle-icon-logo-symbol-free-png.png",
    "title": "CapCut",
    "companyName": "ByteDance",
    "id": 6,
    "description": "CapCut by ByteDance is a professional-grade video editing app that's simple enough for beginners yet powerful enough for creators. It offers advanced editing features such as multi-layer editing, chroma key (green screen), keyframe animation, motion tracking, and slow-motion effects. With CapCut, users can add music, text, filters, stickers, and transition effects to elevate their videos. Optimized for mobile, it allows on-the-go editing and seamless export for platforms like TikTok, Instagram, and YouTube. Whether you're making vlogs, montages, or cinematic clips, CapCut turns your smartphone into a complete video editing studio.",
    "size": 220,
    "reviews": "20K",
    "ratingAvg": 4.7,
    "downloads": "400M",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 75000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Spotify_App_Logo.svg/2048px-Spotify_App_Logo.svg.png",
    "title": "Spotify",
    "companyName": "Spotify Technology S.A.",
    "id": 7,
    "description": "Spotify, developed by Spotify Technology S.A., is a leading music streaming platform that gives users access to millions of songs, albums, and podcasts from artists all around the world. With personalized playlists like Discover Weekly, Daily Mixes, and curated genre stations, Spotify tailors your music experience to your taste. The app supports offline listening, playlist creation, cross-device syncing, and social sharing features. Whether you're relaxing, working out, or commuting, Spotify’s seamless interface and sound quality make it the go-to destination for audio entertainment.",
    "size": 240,
    "reviews": "15K",
    "ratingAvg": 4.8,
    "downloads": "350M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/023/986/704/non_2x/youtube-logo-youtube-logo-transparent-youtube-icon-transparent-free-free-png.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 8,
    "description": "YouTube, owned by Google LLC, is the world’s largest video-sharing platform where users can watch, upload, like, comment, and share videos. It spans a wide range of content including music videos, educational tutorials, live streams, movie trailers, vlogs, and more. With its robust recommendation algorithm, YouTube offers a highly personalized viewing experience. Creators can build audiences, monetize content, and engage with fans through comments and community posts. Features like YouTube Shorts and YouTube Premium enhance the platform further, making it a hub for entertainment, education, and inspiration.",
    "size": 280,
    "reviews": "10K",
    "ratingAvg": 4.6,
    "downloads": "300M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 750000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/017/396/804/non_2x/netflix-mobile-application-logo-free-png.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 9,
    "description": "Netflix, developed by Netflix, Inc., is a leading subscription-based streaming service offering a wide range of TV shows, movies, documentaries, and original content. With critically acclaimed originals like Stranger Things, The Crown, and Money Heist, Netflix has become a powerhouse in the entertainment industry. The platform offers high-definition streaming, multi-device access, offline downloads, and customizable profiles for family use. Netflix's content library is regularly updated with titles across genres and languages, making it a go-to platform for binge-watchers and film lovers alike.",
    "size": 300,
    "reviews": "9K",
    "ratingAvg": 4.7,
    "downloads": "250M",
    "ratings": [
      { "name": "1 star", "count": 8000 },
      { "name": "2 star", "count": 16000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 600000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/016/716/478/non_2x/google-maps-icon-free-png.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 10,
    "description": "Google Maps is a comprehensive and intelligent navigation platform designed to help users explore the world with confidence. It provides real-time GPS navigation, live traffic updates, turn-by-turn directions, and multiple route options based on distance, traffic, and road conditions. Beyond basic navigation, it offers detailed public transit schedules, walking and cycling paths, lane guidance, and even speed limit alerts in certain regions. Users can also discover nearby places like restaurants, gas stations, ATMs, and hotels, complete with ratings, reviews, and photos. With features like offline maps, satellite imagery, Street View, and saved locations, Google Maps is an essential travel and local discovery companion for daily commutes, road trips, and everything in between.",
    "size": 220,
    "reviews": "8.5K",
    "ratingAvg": 4.8,
    "downloads": "200K",
    "ratings": [
      { "name": "1 star", "count": 7000 },
      { "name": "2 star", "count": 14000 },
      { "name": "3 star", "count": 35000 },
      { "name": "4 star", "count": 130000 },
      { "name": "5 star", "count": 500000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/thumbnails/012/871/376/small_2x/zoom-logo-in-blue-colors-meetings-app-logotype-illustration-free-png.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 11,
    "description": "Zoom is a leading cloud-based video conferencing platform that enables users to connect virtually through high-quality video, audio, and chat. Designed for seamless communication, Zoom is ideal for business meetings, online classes, virtual events, and webinars. It supports features like screen sharing, virtual backgrounds, meeting recording, live transcription, and breakout rooms to enhance productivity and engagement. With support for both mobile and desktop, Zoom allows users to join or host meetings from anywhere in the world. Whether you’re collaborating with a team or connecting with friends and family, Zoom offers a secure, scalable, and reliable experience.",
    "size": 200,
    "reviews": "8K",
    "ratingAvg": 4.6,
    "downloads": "180M",
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 400000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/d/de/Amazon_icon.png",
    "title": "Amazon",
    "companyName": "Amazon.com, Inc.",
    "id": 12,
    "description": "Amazon is one of the world's largest and most trusted online shopping platforms, offering a vast selection of products, services, and digital content all in one place. From electronics, clothing, and home essentials to books, toys, and groceries, Amazon delivers a convenient and reliable shopping experience. With features like personalized recommendations, secure checkout, fast shipping, and real-time order tracking, users can shop confidently from the comfort of their home. Whether you’re searching for everyday items or unique finds, Amazon makes shopping easier, faster, and more accessible — all through a user-friendly app available across devices.",
    "size": 250,
    "reviews": "7.5K",
    "ratingAvg": 5,
    "downloads": "150M",
    "ratings": [
      { "name": "1 star", "count": 7000 },
      { "name": "2 star", "count": 14000 },
      { "name": "3 star", "count": 35000 },
      { "name": "4 star", "count": 130000 },
      { "name": "5 star", "count": 500000 }
    ]
  },  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRFG0aHEi4eHo8KArYfF_bgvFrP1k84hAJzTw&s",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 13,
    "description": "Snapchat is a fun and dynamic multimedia messaging app that allows users to instantly share photos, videos, and messages with friends and followers. What sets Snapchat apart is its unique feature where shared content—called “Snaps”—disappears automatically after being viewed, giving you the freedom to share moments without worrying about permanent records. Beyond simple messaging, Snapchat offers creative tools like filters, lenses, stickers, and Bitmojis to make your snaps more expressive and entertaining.",
    "size": 210,
    "reviews": "700K",
    "ratingAvg": 4.5,
    "downloads": "150M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 565000 }
    ]
  },
  {
    "image": "https://uxwing.com/wp-content/themes/uxwing/download/brands-and-social-media/linkedin-app-icon.png",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "id": 14,
    "description": "LinkedIn is the world's largest professional networking platform designed to help individuals connect with colleagues, industry peers, and potential employers. It serves as a comprehensive digital resume where users can showcase their skills, work experience, education, and professional achievements. Beyond simply connecting, LinkedIn offers powerful tools for job seekers to discover opportunities, apply for positions, and receive endorsements and recommendations that boost credibility.",
    "size": 180,
    "reviews": "650K",
    "ratingAvg": 4.6,
    "downloads": "140M",
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 16000 },
      { "name": "4 star", "count": 80000 },
      { "name": "5 star", "count": 550000 }
    ]
  },
  {
    "image": "https://uxwing.com/wp-content/themes/uxwing/download/brands-and-social-media/twitter-app-icon.png",
    "title": "Twitter",
    "companyName": "X Corp.",
    "id": 15,
    "description": "Twitter is a dynamic social media platform designed for sharing short messages, called tweets, which are limited to concise, impactful content. It allows users to post real-time updates, share news, opinions, and engage in conversations with a global audience instantly. Twitter is widely used by individuals, celebrities, journalists, brands, and organizations to broadcast information, participate in trending discussions, and connect directly with followers.",
    "size": 160,
    "reviews": "600K",
    "ratingAvg": 4.4,
    "downloads": "130M",
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 18000 },
      { "name": "4 star", "count": 70000 },
      { "name": "5 star", "count": 495000 }
    ]
  },
  {
    "image": "https://cdn3.iconfinder.com/data/icons/2018-social-media-logotypes/1000/2018_social_media_popular_app_logo_reddit-512.png",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 16,
    "description": "Reddit is a versatile online platform that combines news aggregation, social networking, and community discussions all in one place. It allows users to submit content such as links, text posts, images, and videos, which are then organized into thousands of “subreddits” — specialized communities centered around specific interests, topics, or themes. Users can engage by voting on posts and comments, helping the best content rise to the top. This democratic approach makes Reddit a powerful tool for discovering trending news, niche hobbies, expert advice, entertainment, and a wide variety of viewpoints. Whether you’re looking for in-depth discussions, breaking news, or casual banter, Reddit offers something for everyone.",
    "size": 200,
    "reviews": "550K",
    "ratingAvg": 4.5,
    "downloads": "120M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 470000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Google_Chrome_icon_%28February_2022%29.svg/2048px-Google_Chrome_icon_%28February_2022%29.svg.png",
    "title": "Chrome",
    "companyName": "Google LLC",
    "id": 17,
    "description": "Chrome is a fast, secure, and reliable web browser developed by Google LLC. It offers a seamless browsing experience with lightning-fast page loads, efficient tab management, and powerful security features designed to keep your data safe from phishing and malware. Chrome supports a vast ecosystem of extensions and plugins, enabling users to customize their browsing experience according to their needs. With automatic updates, built-in translation, and syncing across devices, Chrome ensures you stay connected and productive whether you are at home, work, or on the go. Its intuitive user interface combined with advanced developer tools also makes it a favorite among both casual users and web professionals.",
    "size": 150,
    "reviews": "500K",
    "ratingAvg": 4.7,
    "downloads": "110K",
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 429000 }
    ]
  },
  {
    "image": "https://wallpapers.com/images/thumbnail/iconic-paypal-logo-hz1p638jayet7nyc.webp",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "id": 18,
    "description": "PayPal is a trusted and secure digital payments platform created by PayPal Holdings, Inc. It allows users worldwide to send and receive money online quickly and safely. PayPal supports transactions between individuals, businesses, and merchants, making it easy to shop online, transfer funds, and pay for services. The platform incorporates advanced encryption and fraud detection technologies to protect your financial information. PayPal also supports multiple currencies and offers buyer and seller protections, making it a preferred choice for online payments. Its mobile app provides a user-friendly interface with features like invoice creation, transaction history, and instant notifications, ensuring that managing your finances is hassle-free and convenient.",
    "size": 140,
    "reviews": "450K",
    "ratingAvg": 4.6,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 40000 },
      { "name": "5 star", "count": 392000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/017/395/359/non_2x/dropbox-mobile-apps-icon-free-png.png",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 19,
    "description": "Dropbox is a cloud storage service developed by Dropbox, Inc., designed to help users save, sync, and share files and documents across multiple devices effortlessly. It provides a secure and reliable platform where individuals and teams can store photos, videos, work documents, and other important files with automatic backup and version control. Dropbox offers easy collaboration through shared folders and links, allowing real-time updates and access control to ensure everyone stays on the same page. With robust encryption and compliance with data protection standards, Dropbox keeps your data safe while making remote work and file management simple. Its integration with many third-party apps enhances productivity and streamlines workflows for users of all kinds.",
    "size": 180,
    "reviews": "400K",
    "ratingAvg": 4.5,
    "downloads": "950K",
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 35000 },
      { "name": "5 star", "count": 353500 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Adobe_Photoshop_Express_logo_%282020%29.svg/1024px-Adobe_Photoshop_Express_logo_%282020%29.svg.png?20200617142930",
    "title": "Photoshop Express",
    "companyName": "Adobe Inc.",
    "id": 20,
    "description": "Photoshop Express is a powerful yet easy-to-use photo editing app from Adobe Inc. designed for quick edits, creative filters, and enhancements on the go. It offers a wide range of tools including cropping, straightening, rotating, red-eye correction, and spot healing to perfect your images. Users can apply stunning effects, filters, borders, and text overlays to transform ordinary photos into eye-catching visuals. The app supports RAW photo editing, making it suitable for both amateur photographers and professionals. With intuitive touch controls and one-tap adjustments, Photoshop Express allows users to enhance photos quickly and share them directly to social media or cloud storage platforms. It combines Adobe’s trusted photo editing technology with accessibility and ease of use.",
    "size": 160,
    "reviews": "380K",
    "ratingAvg": 4.6,
    "downloads": "900K",
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 339500 }
    ]
  }
]


